#coding: UTF-8
import pandas as pd

# ----------------------------------------------------------------
# CSVファイルを読み込む
# ----------------------------------------------------------------
filename = 'test.csv'
df = pd.read_csv(filename)

print('------------CSVファイル: {} を読み込み------------'.format(filename))
print(df)
# print('データの件数    ＝', len(df))
# print('項目名(ヘッダー)＝', df.columns.values)
# print('インデックス(左列の番号)＝', df.index.values)

# ----------------------------------------------------------------
# sort_valuesメソッド：ソート（並び替え）をして表示
# ----------------------------------------------------------------
print('------------昇順：国語が小さいほど前へ------------')
asc_jp = df.sort_values('国語')
print(asc_jp)

print('------------降順：国語が大きいほど前へ------------')
dec_jp = df.sort_values('国語', ascending=False)
print(dec_jp)

# ----------------------------------------------------------------
# 行と列を入れ替える、リスト型に変換する
# ----------------------------------------------------------------
# 行と列を入れ替える
print("行と列を入れ替える\n", df.T)

# データをリスト化する
print("Pythonのリストデータ型に変換する\n", df.values)

# ----------------------------------------------------------------
# CSVファイルに出力する
#  DataFrame.to_csv('ファイル名.csv')
#     （インデックスを削除,ヘッダー削除）
#     DataFrame.to_csv("export2.csv", index=False, header=False)
# ----------------------------------------------------------------
print('------------国語の昇順で並べ替え------------')
asc_jp = df.sort_values('国語')
print(asc_jp)

filename = 'asc_jp.csv'
asc_jp.to_csv(filename, index=False)
print('------------csv : {} を保存しました------------'.format(filename))
