#coding: UTF-8
import pandas as pd

# ----------------------------------------------------------------
# CSVファイルを読み込む
# ----------------------------------------------------------------
filename = 'test.csv'
df = pd.read_csv(filename)

# 0,1,2,...の列がいらない場合、index_col=0つけるとcsvの０列目をdfの０列目にしてくれる
# df = pd.read_csv(filename, index_col=0)

print('------------CSVファイル: {} を読み込み------------'.format(filename))
print(df)
print('データの件数    ＝', len(df))
print('項目名(ヘッダー)＝', df.columns.values)
print('インデックス(左列の番号)＝', df.index.values)

# ----------------------------------------------------------------
# 列データ、行データ,1つの要素を取得
# ----------------------------------------------------------------
print('------------列データを取得------------')
# 1つの列データを取得する時
# print(df[['国語']])   # df[['国語']]でもOK。

# 複数の列データを取得する時
print(df[['国語', '数学', '社会']])


print('------------行データを取得------------')
# 1つの行データを取得する時  df.loc[行番号]
# print(df.loc[1])        # df.loc[[1]]でもOK。1行が横１列で表示される
# 複数の行データを取得する時
print(df.loc[[1, 3]])

print('------------1つの要素を取得------------')
print(df.loc[3]['国語'])
