#coding: UTF-8
import pandas as pd

# ----------------------------------------------------------------
# CSVファイルを読み込む
# ----------------------------------------------------------------
filename = 'test.csv'
df = pd.read_csv(filename)

print('------------CSVファイル: {} を読み込み------------'.format(filename))
print(df)
print('データの件数    ＝', len(df))
print('項目名(ヘッダー)＝', df.columns.values)
print('インデックス(左列の番号)＝', df.index.values)

# ----------------------------------------------------------------
#列データを追加する
#    df["追加列名"] = [列要素, 列要素,,,,,] 元のdfと同じ数だけ用意する
#行データを追加する
#    df.loc[追加行番号] = [要素, 要素,,,,,] 元のdfと同じ数だけ用意する
# ----------------------------------------------------------------
print('------------列データ,行データを追加する------------')
print('美術の列を追加')
df['美術'] = [68, 73, 82, 77, 94, 96]
print(df)

print('G恵の行を追加')
df.loc[6] = ["G恵", 90, 92, 94, 96, 92, 98]
print(df)

# ----------------------------------------------------------------
#列データを削除する
#    df = df.drop('列名', axis=1)
#行データを削除する
#    df = df.drop('行番号', axis=0)
# ----------------------------------------------------------------
print('------------列データ,行データを削除する------------')
print('社会の列を削除')
df= df.drop('社会', axis=1)
print(df)

print('G恵の行を削除')
df= df.drop(6, axis=0)
print(df)
